Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/help_with_buying_a_home/mortgage_allowance_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Social housing tenants and tenant purchasers who are taking out a mortgage to buy or build a private house may qualify for the Mortgage Allowance Scheme
ga: Tá liúntas de suas le 11,427.64 euro iníoctha thar tréimhse cúig bhliana le tionóntaí an údaráis áitiúil nó tionóntaí atá ag ceannacht ón údarás

source: The Scheme is designed to ease the transition from social housing to paying a mortgage
ga: Tá an liúntas ar fáil freisin do thionóntaí Chumainn Tithíochta a chónaíonn i dtithe atá curtha ar fáil faoin Scéim Fordheontas Cíosa atá ag ceannach nó ag tógáil tí le morgáiste

source: An allowance of up to €11,450 is payable directly to the lending agency over a 5-year period and your repayments are reduced accordingly for the first 5 years of the mortgage
ga: Íoctar an liúntas díreach leis an údarás iasachta agus laghdaítear na haisíocaíochtaí atá le déanamh agat mar is cuí don chéad chúig bhliana den mhorgáiste

source: Your mortgage may be from a commercial lending agency or from a local authority
ga: Is féidir leat do mhorgáiste a fháil ó údarás tráchtála iasachta nó ó údarás áitiúil

source: You may be eligible if you are:
ga: Ní mór de mhorgáiste de ar a laghad 38,092.14 euro a bheith agat

source: • A housing association tenant for more than 1 year in housing provided under the Rental Subsidy Scheme, and you are giving up your tenancy and taking out a mortgage to buy or build a private house
ga: Más ag ceannacht tí thú faoin Scéim Comhúinéireachta, níl tú intofa don Scéim Liúntas Morgáiste

source: The house must be suitable for your needs, meet certain minimum standards and be acceptable to the local authority. The amount of the mortgage must be at least €38,092.14
ga: Ní mór don teach a bheith feiliúnach do do riachtanais, bunchaighdeáin a shásamh agus ní mór don údarás áitiúil a bheith sásta leis

source: The allowance is paid directly to the lending agency and your mortgage payments are reduced in each of the first 5 years as follows:
ga: D'fhéadfá a bheith i dteideal an liúntais:

source: Year Allowance per year First €3,560 Second €2,800 Third €2,040 Fourth €1,780 Fifth €1,270
ga: • Más tionónta nó tionónta atá ag ceannacht thú ón údarás áitiúil agus go bhfuil sé i gceist agat teach príobháideach a cheannach agus do theach a thabhairt ar ais don údarás áitiúil

source: The allowance paid in any year cannot exceed the amount of the mortgage repayments
ga: • tionónta le breis is bliain thú de theach atá curtha ar fáil ag cumann tithíochta faoin scéim Fordheontas Cíosa agus go bhfuil sé i gceist agat teach príobháideach a cheannach agus do theach a thabhairt ar ais don údarás áitiúil

source: Your local authority will have more information and application forms
ga: Déan teagmháil leis an Údarás Áitiúil le tuilleadh eolais a fháil
